app/Controllers/ArchivoController.php

SELECT `archivos`.*, `clasificaciones`.`nombre` AS `clasificacion_nombre`
FROM `archivos`
JOIN `clasificaciones` ON `clasificaciones`.`id` = `archivos`.`clasificacion_id`
WHERE `archivos`.`deleted_at` IS NULL
ORDER BY `archivos`.`id` DESC
---
    public function index()
    {
        $archivoModel = new ArchivoModel();
        $data['archivos'] = $archivoModel->select('archivos.*, clasificaciones.nombre AS clasificacion_nombre')
            ->join('clasificaciones', 'clasificaciones.id = archivos.clasificacion_id')
            ->orderBy('archivos.id', 'desc')
            ->findAll();

SELECT *
FROM `clasificaciones`
WHERE `clasificaciones`.`deleted_at` IS NULL
---
    public function create()
    {
        $clasificacionModel = new ClasificacionModel();
        $data['clasificaciones'] = $clasificacionModel->findAll();