app/Controllers/Autores.php

SELECT *
FROM `autores`
WHERE `autores`.`deleted_at` IS NULL
---
    public function index()
    {
        $data['autores'] = $this->model->findAll();