app/Controllers/ClasificacionController.php

    public function index()
    {
        $clasificacionModel = new ClasificacionModel();
        $data['clasificaciones'] = $clasificacionModel->findAll(); // Obtener todas las clasificaciones
---
SELECT *
FROM `clasificaciones`
WHERE `clasificaciones`.`deleted_at` IS NULL