app/Controllers/Home.php

    public function index()
    {
        $model = new CarouselModel();
        $data['images'] = $model->where('estado', 'activo')->where('tipo', 'imagen')->findAll();
        $data['bblio'] = $model->where('estado', 'activo')->where('tipo', 'video')->findAll();
        $data[] = $model->where('estado', 'activo')->where('tipo', 'gestorbibliografico')->findAll();
---
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'imagen'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'video'
SELECT *
FROM `carousel`
WHERE `estado` = 'activo'
AND `tipo` = 'gestorbibliografico'