app/Controllers/Recursos.php

    public function index()
    {
        $data['recursos'] = $this->recursoModel
            ->select('recursos.*, generos.nombre as genero_nombre, editoriales.nombre as editorial_nombre, autores.id as autor_id, autores.nombre, autores.apellido') // Asegúrate de seleccionar el ID del autor
            ->join('generos', 'generos.id = recursos.genero')
            ->join('editoriales', 'editoriales.id = recursos.editorial', 'left')
            ->join('autores_recursos', 'autores_recursos.recurso_id = recursos.id', 'left')
            ->join('autores', 'autores.id = autores_recursos.autor_id', 'left')
            ->groupBy('recursos.id')
            ->findAll();
---
SELECT `recursos`.*, `generos`.`nombre` as `genero_nombre`, `editoriales`.`nombre` as `editorial_nombre`
FROM `recursos`
JOIN `generos` ON `generos`.`id` = `recursos`.`genero`
JOIN `editoriales` ON `editoriales`.`id` = `recursos`.`editorial`
WHERE `recursos`.`deleted_at` IS NULL