app/Controllers/UserController.php

    public function index()
    {
        $data['users'] = $this->model->findAll();
---
SELECT *
FROM `users`